; domain
(define (domain emergency)
  (:requirements :strips :typing)

  (:types
    drone
    person
    crate
    location
    content
    arm
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (arm-of ?a - arm ?d - drone)
    (free ?a - arm)
    (holding ?a - arm ?c - crate)

    (crate-has ?c - crate ?t - content)
    (person-has ?p - person ?t - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
    )
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-crate ?c ?l)
      (arm-of ?a ?d)
      (free ?a)
    )
    :effect (and
      (not (at-crate ?c ?l))
      (not (free ?a))
      (holding ?a ?c)
    )
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?t - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (arm-of ?a ?d)
      (holding ?a ?c)
      (crate-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (free ?a)
      (not (holding ?a ?c))
    )
  )

)

; problem
(define (problem emergency_d1_l10_p10_c10_g10)
(:domain emergency)
(:objects
	drone1 - drone
	drone1_arm1 - arm
	drone1_arm2 - arm
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
)
(:init
	(at-drone drone1 depot)
	(arm-of drone1_arm1 drone1)
	(arm-of drone1_arm2 drone1)
	(free drone1_arm1)
	(free drone1_arm2)
	(at-crate crate1 depot)
	(at-crate crate2 depot)
	(at-crate crate3 depot)
	(at-crate crate4 depot)
	(at-crate crate5 depot)
	(at-crate crate6 depot)
	(at-crate crate7 depot)
	(at-crate crate8 depot)
	(at-crate crate9 depot)
	(at-crate crate10 depot)
	(crate-has crate1 food)
	(crate-has crate2 food)
	(crate-has crate3 food)
	(crate-has crate4 food)
	(crate-has crate5 medicine)
	(crate-has crate6 medicine)
	(crate-has crate7 medicine)
	(crate-has crate8 medicine)
	(crate-has crate9 medicine)
	(crate-has crate10 medicine)
	(at-person person1 loc2)
	(at-person person2 loc5)
	(at-person person3 loc5)
	(at-person person4 loc3)
	(at-person person5 loc5)
	(at-person person6 loc5)
	(at-person person7 loc6)
	(at-person person8 loc10)
	(at-person person9 loc6)
	(at-person person10 loc9)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 food)
	(person-has person3 medicine)
	(person-has person4 food)
	(person-has person4 medicine)
	(person-has person5 food)
	(person-has person7 medicine)
	(person-has person8 medicine)
	(person-has person9 medicine)
	(person-has person10 food)
	(person-has person10 medicine)
))
)

; plan
1. (pick-up drone1 drone1_arm1 crate10 depot)
   deleted: (at-crate crate10 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate10)
   goals met: 1 of 11
2. (pick-up drone1 drone1_arm2 crate4 depot)
   deleted: (at-crate crate4 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate4)
   goals met: 1 of 11
3. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 0 of 11
4. (deliver drone1 drone1_arm1 crate10 person8 loc10 medicine)
   deleted: (holding drone1_arm1 crate10)
   added: (person-has person8 medicine) (free drone1_arm1)
   goals met: 1 of 11
5. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 2 of 11
6. (pick-up drone1 drone1_arm1 crate9 depot)
   deleted: (at-crate crate9 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate9)
   goals met: 2 of 11
7. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 1 of 11
8. (deliver drone1 drone1_arm2 crate4 person1 loc2 food)
   deleted: (holding drone1_arm2 crate4)
   added: (person-has person1 food) (free drone1_arm2)
   goals met: 2 of 11
9. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 3 of 11
10. (pick-up drone1 drone1_arm2 crate3 depot)
   deleted: (at-crate crate3 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate3)
   goals met: 3 of 11
11. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 2 of 11
12. (deliver drone1 drone1_arm2 crate3 person10 loc9 food)
   deleted: (holding drone1_arm2 crate3)
   added: (person-has person10 food) (free drone1_arm2)
   goals met: 3 of 11
13. (deliver drone1 drone1_arm1 crate9 person10 loc9 medicine)
   deleted: (holding drone1_arm1 crate9)
   added: (person-has person10 medicine) (free drone1_arm1)
   goals met: 4 of 11
14. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 5 of 11
15. (pick-up drone1 drone1_arm1 crate8 depot)
   deleted: (at-crate crate8 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate8)
   goals met: 5 of 11
16. (pick-up drone1 drone1_arm2 crate2 depot)
   deleted: (at-crate crate2 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate2)
   goals met: 5 of 11
17. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 4 of 11
18. (deliver drone1 drone1_arm1 crate8 person7 loc6 medicine)
   deleted: (holding drone1_arm1 crate8)
   added: (person-has person7 medicine) (free drone1_arm1)
   goals met: 5 of 11
19. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 6 of 11
20. (pick-up drone1 drone1_arm1 crate7 depot)
   deleted: (at-crate crate7 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate7)
   goals met: 6 of 11
21. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 5 of 11
22. (deliver drone1 drone1_arm1 crate7 person9 loc6 medicine)
   deleted: (holding drone1_arm1 crate7)
   added: (person-has person9 medicine) (free drone1_arm1)
   goals met: 6 of 11
23. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 7 of 11
24. (pick-up drone1 drone1_arm1 crate6 depot)
   deleted: (at-crate crate6 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate6)
   goals met: 7 of 11
25. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 6 of 11
26. (deliver drone1 drone1_arm2 crate2 person5 loc5 food)
   deleted: (holding drone1_arm2 crate2)
   added: (person-has person5 food) (free drone1_arm2)
   goals met: 7 of 11
27. (deliver drone1 drone1_arm1 crate6 person3 loc5 medicine)
   deleted: (holding drone1_arm1 crate6)
   added: (person-has person3 medicine) (free drone1_arm1)
   goals met: 8 of 11
28. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 9 of 11
29. (pick-up drone1 drone1_arm1 crate5 depot)
   deleted: (at-crate crate5 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate5)
   goals met: 9 of 11
30. (pick-up drone1 drone1_arm2 crate1 depot)
   deleted: (at-crate crate1 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate1)
   goals met: 9 of 11
31. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 8 of 11
32. (deliver drone1 drone1_arm2 crate1 person4 loc3 food)
   deleted: (holding drone1_arm2 crate1)
   added: (person-has person4 food) (free drone1_arm2)
   goals met: 9 of 11
33. (deliver drone1 drone1_arm1 crate5 person4 loc3 medicine)
   deleted: (holding drone1_arm1 crate5)
   added: (person-has person4 medicine) (free drone1_arm1)
   goals met: 10 of 11
34. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 11 of 11
